In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'name':['john','mary'],
    'age':[24,45]
})
df1

   age  name
0   24  john
1   45  mary

In [23]:
df2 = pd.DataFrame({
    'name':['mary','john'],
    'age':[45,89]
})
df2

   age  name
0   45  mary
1   89  john

### union-all

In [25]:
pd.concat([
    df1,df2
],ignore_index=True)

   age  name
0   24  john
1   45  mary
2   45  mary
3   89  john

### union

In [24]:
pd.concat([
    df1,df2
],ignore_index=True).drop_duplicates().reset_index(drop=True)

   age  name
0   24  john
1   45  mary
2   89  john

### concatenate side-by-side

In [30]:
pd.concat([
    df1,df2
],axis=1)

   age  name  age  name
0   24  john   45  mary
1   45  mary   89  john

In [31]:
pd.concat([
    df1,df2
],axis=1).reset_index(drop=True)['age']

   age  age
0   24   45
1   45   89